* Extract food labels
#+begin_src python :results output raw table
import pandas as pd
from cfe.df_utils import df_to_orgtbl

food=pd.read_stata('../Data/Togo_survey2018_fooditems_forEthan.dta')
items = food.food_item.value_counts().reset_index()

df = pd.DataFrame({'Code':items['index'].cat.codes,'Label':items['index'],'Frequency':items.food_item}).set_index('Code')
df.sort_index(inplace=True)

print(df_to_orgtbl(df,float_fmt='%d'))
#+end_src

#+results:
| Code | Label                                                                   | Frequency |
|------+-------------------------------------------------------------------------+-----------|
|    0 | Riz local longs grains                                                  |      1916 |
|    1 | Riz local (Kovié)                                                      |       222 |
|    2 | Riz importé longs grains                                               |      1852 |
|    3 | Riz importé brisé                                                     |       179 |
|    4 | Maïs en épis                                                          |       309 |
|    5 | Maïs en grains                                                         |      5225 |
|    6 | Mil                                                                     |       114 |
|    7 | Sorgho                                                                  |       197 |
|    8 | Blé                                                                    |         1 |
|    9 | Fonio                                                                   |        49 |
|   10 | 11                                                                      |         6 |
|   11 | Farine de maïs                                                         |       511 |
|   12 | Farine de mil                                                           |        24 |
|   13 | Farine de blé local ou importé                                        |         4 |
|   14 | 15                                                                      |         6 |
|   15 | Pâtes alimentaires                                                     |      1868 |
|   16 | Pain moderne                                                            |       335 |
|   17 | Pain traditionnel                                                       |      1121 |
|   18 | Croissants                                                              |        11 |
|   19 | Biscuits                                                                |       236 |
|   20 | Gâteaux                                                                |        66 |
|   21 | Beignets, galettes                                                      |       695 |
|   22 | Viande de bœuf                                                      |       877 |
|   23 | Viande de chameau                                                       |         1 |
|   24 | Viande de mouton                                                        |       140 |
|   25 | Viande de chèvre                                                       |       178 |
|   26 | Abats et tripes (foie, rognon, etc.)                                    |        28 |
|   27 | Viande de porc                                                          |       295 |
|   28 | Poulet sur pied                                                         |       647 |
|   29 | Viande de poulet                                                        |       587 |
|   30 | Viande d'autres volailles domestiques                                   |        55 |
|   31 | Charcuterie (jambon, saucisson), conserves de viandes                   |        18 |
|   32 | Gibiers                                                                 |       108 |
|   33 | Autres viandes n.d.a                                                    |        76 |
|   34 | Chinchard frais                                                         |       469 |
|   35 | Carpe fraîche                                                          |        90 |
|   36 | Dorade fraiche                                                          |        31 |
|   37 | Maquereau frais                                                         |        33 |
|   38 | Chinchard fumé                                                         |      2599 |
|   39 | Anchois fumé                                                           |      4027 |
|   40 | Poisson séché                                                         |       647 |
|   41 | Crabes, crevettes et autres fruits de mer                               |       175 |
|   42 | Conserves de poisson                                                    |       209 |
|   43 | Lait frais                                                              |       243 |
|   44 | Lait caillé, yaourt                                                    |        62 |
|   45 | Lait concentré sucré                                                  |       179 |
|   46 | Lait concentré non-sucré                                              |       181 |
|   47 | Lait en poudre                                                          |       378 |
|   48 | Fromage local                                                           |       532 |
|   49 | Lait et farines pour bébé                                             |        44 |
|   50 | Autres produits laitiers                                                |        25 |
|   51 | Oeufs                                                                   |       934 |
|   52 | Beurre                                                                  |        54 |
|   53 | Beurre de karité                                                       |       146 |
|   54 | Huile de palme rouge                                                    |      2766 |
|   55 | Huile d'arachide                                                        |      2236 |
|   56 | Huile de coton                                                          |       902 |
|   57 | Huile de palme raffinée                                                |      1046 |
|   58 | Autres huiles n.d.a. (maïs, soja, huile palmiste, etc.)                |       378 |
|   59 | Mangue                                                                  |      1781 |
|   60 | Ananas                                                                  |       259 |
|   61 | Orange                                                                  |      1868 |
|   62 | Banane douce                                                            |       965 |
|   63 | Citrons                                                                 |       339 |
|   64 | Autres agrumes                                                          |        14 |
|   65 | Avocats                                                                 |       305 |
|   66 | Pastèque, Melon                                                        |        79 |
|   67 | Dattes                                                                  |        65 |
|   68 | Noix de coco                                                            |       190 |
|   69 | Canne à sucre                                                          |       131 |
|   70 | Autres fruits (pommes, raisin, etc.)                                    |       218 |
|   71 | Salade (laitue)                                                         |       140 |
|   72 | Choux                                                                   |       118 |
|   73 | Carotte                                                                 |       145 |
|   74 | Haricot vert                                                            |        98 |
|   75 | Concombre                                                               |        81 |
|   76 | Aubergine, Courge/Courgette                                             |       404 |
|   77 | Poivron frais                                                           |        91 |
|   78 | Tomate fraîche                                                         |      3675 |
|   79 | Tomate séchée                                                         |        21 |
|   80 | Gombo frais                                                             |      2897 |
|   81 | Gombo sec                                                               |      2562 |
|   82 | Oignon frais                                                            |      4591 |
|   83 | Ail                                                                     |      1782 |
|   84 | Feuilles d'oseille (dakoumou, bissap/floerè)                           |      1282 |
|   85 | Feuilles de baobab                                                      |      2030 |
|   86 | Gboma                                                                   |      1350 |
|   87 | Adémè (Feuilles crin-crin)                                            |      2621 |
|   88 | Moringa, feuilles de manioc, feuilles de taro et autres feuilles        |       372 |
|   89 | Autre légumes frais n.d.a                                              |       166 |
|   90 | Concentré de tomate                                                    |      2281 |
|   91 | Petits pois                                                             |        23 |
|   92 | Petit pois secs                                                         |         2 |
|   93 | Autres légumes secs n.d.a                                              |        65 |
|   94 | Niébé/Haricots secs                                                   |      3118 |
|   95 | Arachides fraîches en coques                                           |       359 |
|   96 | Arachides séchées en coques                                           |       186 |
|   97 | Arachides décortiquées ou pilées                                     |       457 |
|   98 | Arachide grillée                                                       |       423 |
|   99 | Pâte d'arachide                                                        |       600 |
|  100 | Sésame                                                                 |      1061 |
|  101 | Noix de cajou                                                           |         3 |
|  102 | Noix de karité                                                         |         6 |
|  103 | Manioc                                                                  |       819 |
|  104 | Igname                                                                  |      2172 |
|  105 | Plantain                                                                |       218 |
|  106 | Pomme de terre                                                          |        59 |
|  107 | Taro, macabo                                                            |       227 |
|  108 | Patate douce                                                            |       234 |
|  109 | Autres tubercules n.d.a                                                 |         4 |
|  110 | Farines de manioc                                                       |       316 |
|  111 | Gari, tapioca                                                           |      2578 |
|  112 | Attiéke                                                                |        26 |
|  113 | Sucre (poudre ou morceaux)                                              |      3121 |
|  114 | Miel                                                                    |       228 |
|  115 | Chocolat à croquer, pâte à tartiner                                  |        23 |
|  116 | Caramel, bonbons, confiseries, etc                                      |        31 |
|  117 | Sel                                                                     |      5955 |
|  118 | Piment                                                                  |      5828 |
|  119 | Gingembre                                                               |      2690 |
|  120 | Cube alimentaire (Maggi, Jumbo, )                                       |      5425 |
|  121 | Arôme (Maggi, Jumbo, etc.)                                             |        88 |
|  122 | Afintin (Moutarde africaine)                                            |      3099 |
|  123 | Mayonnaise                                                              |       170 |
|  124 | Vinaigre /moutarde                                                      |        76 |
|  125 | Autres condiments (poivre etc.)                                         |        97 |
|  126 | Noix de cola                                                            |       364 |
|  127 | Autres produits alimentaires                                            |        82 |
|  128 | Café                                                                   |       112 |
|  129 | Thé                                                                    |       149 |
|  130 | Chocolat en poudre                                                      |       131 |
|  131 | Autres tisanes et infusions n.d.a. (quinquelibat, citronelle, etc.)     |       151 |
|  132 | Jus de fruits (orange, bissap, gingembre, jus de cajou,etc.)            |       278 |
|  133 | Eau minérale/ filtrée                                                 |       265 |
|  134 | Boissons gazeuses (coca, etc.)                                          |       129 |
|  135 | Jus en poudre                                                           |        22 |
|  136 | Bières et vins traditionnels (dolo, vin de palme, vin de raphia, etc.) |      1135 |
|  137 | Bières industrielles                                                   |       222 |

* Estimate demand system
#+begin_src python :tangle /tmp/estimate.py
import cfe
import pandas as pd
import numpy as np

y = np.log(pd.read_parquet('../2018/_/food_expenditures.parquet'))
z = pd.read_parquet('../2018/_/household_characteristics.parquet')

y['t'] = 2018
z['t'] = 2018

y['m'] = 'Togo'
z['m'] = 'Togo'

y = y.reset_index().set_index(['j','t','m'])
z = z.reset_index().set_index(['j','t','m'])

r = cfe.Result(y=y,z=z)

#+end_src
